[
    {
        "label": "Mejora de Prompt",
        "value": "Prompt para IA de Desarrollo y Programación.\n\n[CONTEXTO]\nObjetivo: En funsión del contenido de la  solicitud se debe diseñar un prompt altamente efectivo y específico para una Inteligencia Artificial especializada en desarrollo de aplicaciones y edición de código. Este prompt debe instruir a la IA para que cumpla rigurosamente con los siguientes criterios:\n\nCriterios de Comportamiento de la IA Target:\n\nAcción Directa y Ejecución: La IA debe ejecutar directamente las tareas de codificación o desarrollo solicitadas. Se prohíbe generar planes, descripciones conceptuales, propuestas de cómo abordaría la tarea o cualquier preámbulo. \n\n[ESPERADO]\nEl resultado debe ser el entregable final solicitado (código funcional, modificaciones específicas, configuraciones, scripts, etc.).\nComunicación Exclusiva en Español: Todas las interacciones, respuestas, explicaciones y cualquier texto generado por la IA deben estar íntegramente en español, independientemente del idioma del prompt original o de las referencias de código proporcionadas.\nPrecisión y Concisión: La IA debe ser directa y eficiente, entregando solo la información y el código necesario para la tarea, sin divagaciones ni contenido superfluo.\nFormato de Salida Requerido:\n\nSe esperan dos textos distintos como resultado de esta optimización:\n\nInterpretación de la solicitud (Español): Una explicación clara y concisa en español que resuma el objetivo y los criterios de la solicitados.\nPrompt Optimizado (Inglés): El prompt final, redactado en inglés, diseñado para ser utilizado directamente con la IA de desarrollo de aplicaciones y edición de código, asegurando el cumplimiento de los \"Criterios de Comportamiento de la IA Target\" descritos anteriormente."
    },
    {
        "label": "Generación de Código",
        "value": "Actúa como desarrollador Senior. Genera el código completo y funcional para:"
    },
    {
        "label": "Refactorización",
        "value": "Analiza el siguiente código, busca errores y refactoriza aplicando mejores prácticas:"
    },
    {
        "label": "Explicación Técnica",
        "value": "Explica detalladamente el funcionamiento lógico del siguiente fragmento:"
    },
    {
        "label": "Traducción Técnica",
        "value": "Traduce el siguiente texto técnico al Inglés preservando la terminología:"
    },
    {
        "label": "Plantilla de Prueba",
        "value": "Prompt para IA"
    },
    {
        "label": "Plantilla de Prueba (Copia)",
        "value": "**Nuevo Proyecto**\nVamos a iniciar un nuevo proyecto de desarrollo.\nGenera el prompt para solicitar a la IA que haga los siguiente:"
    },
    {
        "label": "Mejora de Prompt (Copia)",
        "value": "**Mejora el prompt v2**\nEl objetivo es crear un prompt altamente efectivo para una Inteligencia Artificial especializada en desarrollo de aplicaciones y edición de código. Este prompt debe asegurar que la IA:\n1 - Actúe directamente: Realice las tareas de codificación o desarrollo solicitadas sin generar planes, descripciones de cómo lo haría o propuestas conceptuales. La IA debe ejecutar la acción y entregar el resultado final (código, modificaciones, etc.).\n2 - Interactúe y Responda en Español: Aunque el prompt original y las referencias de código puedan estar en inglés, todas las respuestas, interacciones y el texto explicativo de la IA deben ser en español.\n3 - Sea Precisa y Concisa: La IA debe entregar el resultado esperado de forma directa, sin divagaciones, proporcionando solo lo necesario para la tarea."
    },
    {
        "label": "Explicación Técnica (Copia)",
        "value": "Corrige, si es necesario, la redacción y coherencia del siguiente texto.\nNo debes hacer lo que dice el prompt solo optimizarlo o redactarlo mejor."
    }
]